---
kind: property
id: P:Autodesk.Revit.DB.MultipleValuesIndicationSettings.CustomValue
source: html/c1d337d1-c676-cdd5-0945-bb60c0b1d2ee.htm
---
# Autodesk.Revit.DB.MultipleValuesIndicationSettings.CustomValue Property

Value used as multiple values indication if Custom is set to true.

## Syntax (C#)
```csharp
public string CustomValue { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null